Revit 2027 API
FamilyInstance.StructuralType Property
Provides the primary structural type of the instance, such as beam or column etc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralType StructuralType { get; }
Public ReadOnly Property StructuralType As StructuralType
	Get
public:
property StructuralType StructuralType {
	StructuralType get ();
}
member StructuralType : StructuralType with get
Property Value
StructuralType
Example
public void GetStructuralType(FamilyInstance familyInstance)
{
    string message = "";
    switch (familyInstance.StructuralType)
    {
        case StructuralType.Beam:
            message = "FamilyInstance is a beam.";
            break;
        case StructuralType.Brace:
            message = "FamilyInstance is a brace.";
            break;
        case StructuralType.Column:
            message = "FamilyInstance is a column.";
            break;
        case StructuralType.Footing:
            message = "FamilyInstance is a footing.";
            break;
        default:
            message = "FamilyInstance is non-structural or unknown framing.";
            break;
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace